clear
% 事件最早时间：以事件j为起点的各工作最早可能开始时间，也表示为j为终点的事件的各工作的最早可能完成时间
% 事件最晚时间：在不影响总工期的条件下，以事件i为起点的各工作最迟必须开始时间

% g = inf(8);
% 
% g(1, 2) = 5; g(1, 3) = 10; g(1, 4) = 11;
% g(2, 5) = 4;
% g(3, 4) = 4; g(3, 5) = 0;
% g(4, 6) = 15;
% g(5, 6) = 21; g(5, 7) = 25; g(5, 8) = 35;
% g(6, 8) = 20; g(6, 7) = 0;
% g(7, 8) = 15;
% g1 = g';
% 
% L = size(g, 1);
% t1 = zeros(1, 8);
% t2 = inf(1, 8);

% 按照拓扑序进行递推
% for i = 1 : L
%     for j = i + 1 : L
%         if g(i, j) == inf
%             continue 
%         end
%         if t1(i) + g(i, j) > t1(j)
%             t1(j) = t1(i) + g(i, j);
%         end
%     end
% end
% 
% t2(8) = t1(8);
% 
% for i = L : -1 : 1
%     for j = i - 1 : -1 : 1
%         if g1(i, j) == inf
%             continue 
%         end
%         if t2(i) - g1(i, j) < t2(j)
%             t2(j) = t2(i) - g1(i, j);
%         end
%     end
% end






